import React from "react";
import profile from "../../images/profile4.png";

const Bio = () => {
  let content =
    "אני אדם חיובי, עם רוח מופעלת ומאמין בעצמו ובאנושיות, אני מאמין בכל אחד להיות יכול להשתפר ולהיות טוב יותר ולהשפיע על החברה. אני משתמש בכוחו שלי ללמוד ולגורר כלי להשתפר, ואני תמיד מחפש לסיים קושיים ולעזור לאנשים לסיים את קושייהם בחיי. במקור אני מתאים לכל מקורות הזמינים לי, כדי להצליח בחיי ולהשתפר ככל האפשר. אני מאמין שכל מי שרוצה ומאמין בעצמו יכול להוות מי שהוא רוצה להיות, ואני מאמין שכל חלום יכול להיות מופשר עם התחנה והכוח לעשות את זה. כמובן, החיים לא הם מדויקים וכלי קשים מתרחשים לכל אחד מנוסעי הדרך, אך אני מאמין שכל אחד יכול לעזור לעצמו ולעזור לאנשים סביבו להשתפר ולהיות טוב יותר. בעיקר, אני אדם שאוהב לחיות ולהיות יכול להשפיע ולגורר";
  content = content.split(".").map((word, index) => (
    <p key={index} className="bio-text">
      {word + "."}
    </p>
  ));

  return (
    <div className="bio">
      <img className="bio-img" src={profile} alt="profile" />
      <div>
        <h1 className="bio-title">אז מי אני?</h1>
        <div>{content}</div>
      </div>
    </div>
  );
};

export default Bio;
